import ContentH from "@/components/contents/ContentH";
import ContentP from "@/components/contents/ContentP";
import ImgHeader from "@/components/images/ImgHeader";
import React from "react";

type Props = {};

const About = (props: Props) => {
    return (
        <div className="w-full vstack justify-center">
            <ImgHeader
                src="https://res.cloudinary.com/dupfwlkgb/image/upload/v1679685011/b95932808cdd1de0ebfbece94997229d_s072yi.jpg"
                alt="صابر سلطانی"
            />
            <h1 className="text-blue-700 font-bold text-center text-xl mt-5">
                درباره آواکادو
            </h1>
            <div className="w-full lg:w-[60vw] flex flex-col items-start">
                <ContentP
                    cls="mt-5"
                    txt="برنامه نویسی را به صورت رسمی با زبان جاوااسکریپت شروع کردم، البته قبل از آن نیز در دانشگاه زبان C و به صورت خودآموز با زبان پایتون آشنایی داشتم اما رشد بی سابقه کتابخانه ها و فریمورک های این زبان بدون شک آن را به محبوب ترین و قوی ترین زبان برنامه نویسی حال حاضر تبدیل کرده.برای فرانت اند از کتابخانه React.js و فریمورک Next.js در پلتفرم های در بستر وب و برای ساخت اپلیکیشن های نیتیو از کتابخانه React Native که اپلیکیشن های محبوبی مثل اینستاگرام و فیسبوک از این تکنولوژی ساخته شده اند استفاده می کنم. در سال گذشته نیز با توجه به امکانات گسترده زبان برنامه نویسی Rust یادگیری آن را شروع کرده ام و در بعضی از پروژه های خود از آن استفاده می کنم."
                />
                <ContentH cls="mt-5" txt="تجربه های کاری" />
                <ContentP
                    cls="mt-5"
                    txt="در دوران پس از تحصیل در دانشگاه در شرکت های مختلفی ابتدا به عنوان برنامه نویس فرانت اند و در دو سال گذشته به عنوان Full-Stack Developer مشغول کار شدم ، از جمله شرکت های مطرح می توان از دیجی کالا به عنوان Full-Stack Developer و شرکت نت بار به عنوان Front-End Developer نام ببرم . با توجه به سقوط ارزش ریال در دو سال گذشته و تسلط مناسب من با زبان انگلیسی پس از دیجیکالا به سمت شرکت های خارج از کشور به صورت دورکاری روی آوردم و در این مدت با کشورهای کانادا و ترکیه همکاری داشتم و در حال حاضر نیز در شرکت Ekska Teknik مشغول به فعالیت هستم. با گذشت سن و کسب تجربه های بیشتر اعتقاد فکری حال حاضر خود را کار کردن به عنوان فریلنسر که آزادی کار بیشتری را فراهم می کند می دانم که فرصت ادامه یادگیری و تحصیل را برای بنده مهیا ساخته است."
                />
                <ContentP txt="آموزش را مهمترین برنامه حال حاضر و آینده خود می دانم و همواره قسمتی از ساعات روزانه خود را صرف تحصیل و یادگیری کرده ام. از نظر جامعه برنامه نویسان شاید یکی از سخترین قسمت های این شغل یادگیری مداوم است چرا که تمامی ابزار برنامه نویس به صورت روزانه در حال تغییر است اما من نظری مخالف این را دارم چرا که یکی از زیباترین قسمت های این شغل را یادگیری مداوم می دانم." />
            </div>
        </div>
    );
};

export default About;
